app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |f|
      artist = Artist.find_or_create_by(name: f[1])
      Song.create(title: f[0], artist_id: artist.id)
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-07-01 00:31:50.113281"], ["updated_at", "2019-07-01 00:31:50.113281"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-07-01 00:36:07.639277"], ["updated_at", "2019-07-01 00:36:07.639277"], ["artist_id", 1]]